using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task_12
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("1.Java или Джава е обектно-ориентиран език за програмиране. Кодът, написан на Java, не се компилира до машинен код за определен процесор, а до специфичен за езика код, наречен байт код. Поради това за изпълнението на програма, написана на Java, е необходима т. нар. виртуална машина (на английски: Java Virtual Machine).");
            Console.WriteLine("2.С++ (произнася се „си-плюс-плюс“) е неспециализиран език за програмиране от високо ниво. Той е обектно-ориентиран език със статични типове. От 1990-те, C++ е един от най-популярните комерсиални езици за програмиране");
            Console.WriteLine("3.C# (C Sharp е обектно-ориентиран език за програмиране, разработен от Microsoft, като част от софтуерната платформа .NET. Стремежът още при създаването на C# езика е бил да се създаде един прост, модерен, обектно-ориентиран език с общо предназначение. ");
            Console.WriteLine("4.С (произнася се „си“ в оригинал на английски, защото е на латиница) е език за програмиране, разработен от Денис Ричи[1] в периода 1969 – 1973 г. Разработката на езика е тясно свързана с операционната система UNIX, чието ядро впоследствие бива пренаписано на езика C.");
            Console.WriteLine("5.PHP е скриптов език върху сървърната (обслужваща) страна език с отворен код, който е проектиран за уеб програмиране и е широко използван за създаване на сървърни приложения и динамично уеб-съдържание.");
            Console.WriteLine("За разлика от С и С++ за който се смята, че са доста примитивни, остарели и умиращи езица за програмиране С# е съвременен и изключително прост и лесен за научаване език. Поостарелият С все още е популярен, защото е незаменим при писане на операционни системи, хардуерни драйвери или за програмиране на промишлени контролери. С++ пък поради по-голямата си близост до С е подходящ при писане на отделни приложения, които изискват много близка работа с хардуера или имат специални изисквания за бързодействието. За всички други случаи С# е в пъти по-добър, което най-вече се дължи на това че е обектно-ориентиран и позволява бърза и лесна работа с обектите от реалния свят.");
        }
    }
}
